trade_exp/src/Documents/СлужебнаяЗаписка/СлужебнаяЗаписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="52f1918a-e667-4bbf-a691-9c76e146951a">
  <name>СлужебнаяЗаписка</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="a6bac9e0-b45c-4618-820d-132f122a737c">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12ab7e5d-1abf-4306-96e8-0133b4da3735">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a85d255-85d5-4146-8eba-04c37fd852dc">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c69b2ba2-c7a3-4dbb-af2d-1fce7732d522">
    <name>Утверждающий1</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3177c995-dbd0-4f2b-9920-388a2e0ed0ba">
    <name>Утверждающий2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4662522d-3c43-4a87-88e8-5450d5020c45">
    <name>Утверждающий3</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b921667-e7c9-44e1-9287-5e3a5fd4c4d0">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80ad1474-160e-4bf5-b8ad-a48891e39f4d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="26a26ddb-42cd-4e5d-9353-d3bef12582f3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="741fa878-8c41-487d-8093-1d6431b7daf3">
    <name>ЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9866dac-c2fa-443e-b38c-1c00339595b9">
    <name>ИДБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ddd6528-622a-4284-aba0-7a23d6bb1ffa">
    <name>Утверждающий4</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe962240-a26d-4fad-b244-c72ae4a3ab6c">
    <name>Утверждающий5</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="bbd84fd9-9e38-4a1d-83ec-eea33e5bf6f8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5535536a-9258-4159-a8e1-e732f3a05672">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9bab6f04-9833-4d64-8948-2b704191a2d7">
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="729f2688-3afd-4e10-8c22-24e34f4df651">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b3bd4f2a-21ae-4fa6-b33d-28f93fe1271e">
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="edb8e692-5d71-4789-804e-2590827d4b5c">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1389375a-6056-4aea-adca-331f801f1abf">
      <name>НазначениеОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcafb42a-e1be-4538-86b0-bb6870876a62">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1f25ee78-77b4-4fea-8ca1-d4d80b43bbc0">
      <name>КоличествоУпаковокФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="371ca631-23a9-41ff-b820-f614ed61ff2b">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1ec9e136-49f4-4011-b0ef-26ff7994b6e5">
      <name>ЦенаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="34afd76b-1dc8-42f6-a2b1-fa4625cfa889">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dfa7dac4-fd67-43e0-a51f-61a136e4dbfd">
      <name>СуммаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="781c3ce4-e538-4e6f-80c8-9735d29bd278">
      <name>ПричинаБлокировки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e926fe00-f670-4118-86bf-e23d7ede60f2">
      <name>ПричинаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="36bce962-837f-464c-93a1-e1fc16ffc3e6">
      <name>Отклонение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60763d4a-d91b-4078-bf09-c8cd8a867503">
      <name>Основание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a0c8f535-e00c-401c-9aaa-994cb0ef95a0">
      <name>ЯПХ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ba11c8d8-c438-4ed1-a658-46e5f58f561a">
      <name>КоличествоПоУчетуВЗонеХранения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/Альтерра_ИдентификаторыОбъектовБ24/Альтерра_ИдентификаторыОбъектовБ24.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee4a31c5-7fc2-4603-a3a6-a3b2f164e25f">
  <name>Альтерра_ИдентификаторыОбъектовБ24</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="563fa98d-8b10-47a9-b3b6-bbab0bed0c7c">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d9749d62-9a16-4082-891b-9c5ac00a2099">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/СлужебнаяЗаписка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
                                                
Процедура ОтправитьНаСогласованиеСлужебнуюЗаписку(Ссылка) Экспорт
	
	ИДТипаБлока = "lists_socnet";
	ИДБлока = "123";
	КодЭлементаПроцесса = "memo_"+Формат(ТекущаяДата(), "ДФ=ddmmyyHHMMss");
	Поля = Новый Структура;
	Если Ссылка.Вид = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересчет") Тогда
		Name = "Оформите " + НРег(Строка(Ссылка.Товары[0].Основание)); 
		Текст = Name;
	Иначе
		Name = "Служебная записка из 1С № " + Ссылка.Номер;
		
		МОснований = Ссылка.Товары.Выгрузить().ВыгрузитьКолонку("Основание");
		Основания = Новый Массив;
		Для Каждого Элемент Из МОснований Цикл
			Если Основания.Найти(Элемент) = Неопределено Тогда
				Основания.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		СтрОснования = НРег(СтрСоединить(Основания, Символы.ПС));
		
	    НаСумму = ?(Основания.Количество() = 1, "на сумму ", "на общую сумму ");
		Текст = Строка(Ссылка) + " на основании: " + Символы.ПС + СтрОснования + Символы.ПС
			+ НаСумму + Ссылка.Товары.Итог("Сумма") + "руб.";
	КонецЕсли;
	
	Поля.Вставить("Name", Name);
	Поля.Вставить("DETAIL_TEXT", Текст);
	ПользовательБитрикс = АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Ссылка.Ответственный);
	Поля.Вставить("CREATED_BY", ПользовательБитрикс);
	Поля.Вставить("PROPERTY_873", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Ссылка.Исполнитель));
	Если ЗначениеЗаполнено(Ссылка.Утверждающий1) Тогда
		Поля.Вставить("PROPERTY_880", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Ссылка.Утверждающий1));
	КонецЕсли;
	Если ЗначениеЗаполнено(Ссылка.Утверждающий2) Тогда
		Поля.Вставить("PROPERTY_881", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Ссылка.Утверждающий2));
	КонецЕсли;
	Если ЗначениеЗаполнено(Ссылка.Утверждающий3) Тогда
		Поля.Вставить("PROPERTY_882", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Ссылка.Утверждающий3));
	КонецЕсли; 
	Если ЗначениеЗаполнено(Ссылка.Утверждающий4) Тогда
		Поля.Вставить("PROPERTY_2067", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Ссылка.Утверждающий4));
	КонецЕсли;
    Если ЗначениеЗаполнено(Ссылка.Утверждающий5) Тогда
		Поля.Вставить("PROPERTY_2068", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(Ссылка.Утверждающий5));
	КонецЕсли;

	Поля.Вставить("PROPERTY_2468", "19592");

	
	//Файл без остатков
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	Печать(ТабДок, Ссылка, Истина, Ложь);
	ВременныйФайл = ПолучитьИмяВременногоФайла(".pdf");
	ТабДок.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.PDF);
	
	ЗнФайла = Новый ДвоичныеДанные(ВременныйФайл);
	Бэйз64Строка = Base64Строка(ЗнФайла);
    Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ВК, "");
    Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ПС, "");

	ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("id", "695929");
	ПараметрыЗапроса.Вставить("data",Новый Структура("NAME,CREATED_BY,UPDATED_BY", Строка(Name)+ "_" + Строка(КодЭлементаПроцесса)+".pdf", ПользовательБитрикс, ПользовательБитрикс));
	ПараметрыЗапроса.Вставить("fileContent",Бэйз64Строка);
	
	Результат =  АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("disk.folder.uploadfile", ПараметрыЗапроса);
	Ид = СтрЗаменить(Строка(Результат.result.ID),Символы.НПП,"");
	МассивИДФайлов = Новый Структура();
	МассивИдФайлов.Вставить("n"+Строка(1),"n"+Ид);
	
	//ПричинаБлокировки = Ссылка.Товары.Выгрузить()[0].ПричинаБлокировки;
	//Если ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Брак на складе") Тогда
		// прикрепляем фото
		СсылкиНаФото = РаспарситьСтрокуВыбратьСсылки(Ссылка.Комментарий);
		НомерВложения = 2;
		Для Каждого Ссылка_ Из СсылкиНаФото Цикл
			//Сообщить(Ссылка_);
			Base64Фото = Base64Строка(Новый ДвоичныеДанные(Ссылка_));
			ПараметрыЗапроса = Новый Структура; 
			ПараметрыЗапроса.Вставить("id", "695929");
			ПараметрыЗапроса.Вставить("fileContent", Base64Фото);
			ПараметрыЗапроса.Вставить("data", Новый Структура("NAME,CREATED_BY,UPDATED_BY",
															"Блокировка № " + Сред(Ссылка_, СтрНайти(Ссылка_, "\", НаправлениеПоиска.СКонца) + 1),
															ПользовательБитрикс,
															ПользовательБитрикс));
			ПараметрыЗапроса.Вставить("generateUniqueName", "true");
			Результат =  АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("disk.folder.uploadfile", ПараметрыЗапроса);
			ID = СтрЗаменить(Строка(Результат.result.ID),Символы.НПП,"");
			МассивИдФайлов.Вставить("n"+Строка(НомерВложения),"n"+ID);
			НомерВложения = НомерВложения + 1;
			//Сообщить(Результат.result.NAME);
			//Сообщить(Результат.result.DETAIL_URL);
			//Текст = Текст + Символы.ПС + Ссылка_;
		КонецЦикла;
	//КонецЕсли;
	
	Поля.Вставить("PROPERTY_2331", МассивИдФайлов);
	
	//Файл с остатками
	ТабДокОстатки = Новый ТабличныйДокумент;
	ТабДокОстатки.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокОстатки.АвтоМасштаб = Истина;
	Печать(ТабДокОстатки, Ссылка, Истина, Истина);
	ВременныйФайл = ПолучитьИмяВременногоФайла(".pdf");
	ТабДокОстатки.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.PDF);
	
	ФайлZIP = ПолучитьИмяВременногоФайла(".zip");
	НовыйАрхив = Новый ЗаписьZipФайла(ФайлZIP, "3532", "Файл с остатками", МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный, МетодШифрованияZIP.Zip20);
	НовыйАрхив.Добавить(ВременныйФайл, РежимСохраненияПутейZIP.НеСохранятьПути);
	НовыйАрхив.Записать();
	
	ЗнФайла = Новый ДвоичныеДанные(ФайлZIP);	
	Бэйз64Строка = Base64Строка(ЗнФайла);
	Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ВК, "");
	Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ПС, "");

	ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("id", "695929");
	ПараметрыЗапроса.Вставить("data",Новый Структура("NAME,CREATED_BY,UPDATED_BY", "(Остатки)_" + Строка(Name)+ "_" + Строка(КодЭлементаПроцесса)+".zip", ПользовательБитрикс, ПользовательБитрикс));
	ПараметрыЗапроса.Вставить("fileContent",Бэйз64Строка);
	
	Результат =  АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("disk.folder.uploadfile", ПараметрыЗапроса);
	Ид = СтрЗаменить(Строка(Результат.result.ID),Символы.НПП,"");
	МассивИДФайловСОстатками = Новый Структура();
	МассивИДФайловСОстатками.Вставить("n"+Строка(1),"n"+Ид);
	
	Поля.Вставить("PROPERTY_3532", МассивИДФайловСОстатками);
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка(ИДТипаБлока, ИДБлока, КодЭлементаПроцесса, Поля, Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;
	Если СтруктураОтвета.Свойство("Результат") или СтруктураОтвета.Свойство("result") Тогда
		ЗаписатьВРегистрОбмена(Ссылка, СтруктураОтвета.result);
		Док = Ссылка.ПолучитьОбъект();
		Док.ИДБизнесПроцесса = СтруктураОтвета.result;
		Док.Статус = "На утверждении";
		Док.Записать();
	КонецЕсли;

КонецПроцедуры

Функция РаспарситьСтрокуВыбратьСсылки(Строка_)
	Ссылки_ = Новый Массив;
	ЧислоВхождений = СтрЧислоВхождений(Строка_, "\\");
	Если ЗначениеЗаполнено(СокрЛП(Строка_)) И ЧислоВхождений > 0 Тогда
		НачальнаяПозиция = 1;
		Для Счетчик = 1 По ЧислоВхождений Цикл
			НачальнаяПозиция = СтрНайти(Строка_, "\\", , , Счетчик);
			Ссылки_.Добавить(Сред(Строка_, НачальнаяПозиция, СтрНайти(Строка_, ".png", , НачальнаяПозиция) + 4 - НачальнаяПозиция));
		КонецЦикла;
	КонецЕсли;
	Возврат Ссылки_;
КонецФункции

Процедура ЗаписатьВРегистрОбмена(Ссылка, Идентификатор)
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.Альтерра_ИдентификаторыОбъектовБ24.СоздатьМенеджерЗаписи();
	Запись.Объект = Ссылка;
	Запись.Идентификатор = Формат(Идентификатор, "ЧГ=0");
	Запись.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка, Отправка = Неопределено, ФормироватьСОстатками = Неопределено) Экспорт
	
	Если Отправка = Неопределено Тогда
		Отправка = Ложь;
	КонецЕсли;
	
	Пересчет = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересчет");
	Пересорт = ПредопределенноеЗначение("Перечисление.ВидыСлужебныхЗаписок.Пересорт");
	
	Макет = Документы.СлужебнаяЗаписка.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|			СлужебнаяЗаписка.Ссылка КАК Документ,
		|			СпрИсполнитель.Наименование КАК ИспНаименование,
		|			СпрОтветственный.Наименование КАК ОтвНаименование,
		|			СпрРуководитель.Наименование КАК РукНаименование,
		|			СлужебнаяЗаписка.Вид КАК Вид,
		|			СлужебнаяЗаписка.Дата КАК Дата,
		|			СлужебнаяЗаписка.ЗаСчет КАК ЗаСчет,
		|			СлужебнаяЗаписка.Исполнитель КАК Исполнитель,
		|			СлужебнаяЗаписка.Исполнитель.Представление КАК ИсполнительФИО,
		|			СпрИсполнитель.Должность.Представление КАК ДолжностьИсполнитель,
		|			СлужебнаяЗаписка.Комментарий КАК Комментарий,
		|			СлужебнаяЗаписка.Номер КАК Номер,
		|			СлужебнаяЗаписка.Ответственный КАК Ответственный,
		|			СлужебнаяЗаписка.Ответственный.Представление КАК ОтветственныйФИО,
		|			СпрОтветственный.Должность.Представление КАК ДолжностьОтветственный,
		|			СлужебнаяЗаписка.Склад КАК Склад,
		|			СлужебнаяЗаписка.Статус КАК Статус,
		|			СлужебнаяЗаписка.Утверждающий1 КАК Руководитель,
		|			СлужебнаяЗаписка.Утверждающий1.Представление КАК РуководительФИО,
		|			СпрРуководитель.Должность.Представление КАК ДолжностьРуководитель,
		|			СлужебнаяЗаписка.Утверждающий2 КАК Утверждающий2,
		|			СлужебнаяЗаписка.Утверждающий3 КАК Утверждающий3,
		|			СлужебнаяЗаписка.Товары.(
		|				НомерСтроки КАК НомерСтроки,
		|				Номенклатура.Код КАК Код,
		|				Номенклатура КАК Номенклатура,
		|				Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|				НоменклатураОприходование.Код КАК КодОприходование,
		|				НоменклатураОприходование КАК НоменклатураОприходование,
		|				НоменклатураОприходование.ЕдиницаИзмерения КАК ЕдиницаИзмеренияОприходование,
		|				Характеристика КАК Характеристика,
		|				ХарактеристикаОприходование КАК ХарактеристикаОприходование,
		|				Назначение КАК Назначение,
		|				НазначениеОприходование КАК НазначениеОприходование,
		|				КоличествоУпаковок КАК КоличествоУпаковок,
		|				ЯПХ КАК КоличествоУпаковокЯПХ,
		|				КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
		|				Цена КАК Цена,
		|				ЦенаОприходование КАК ЦенаОприходование,
		|				Сумма КАК Сумма,
		|				СуммаОприходование КАК СуммаОприходование,
		|				ПричинаБлокировки КАК ПричинаБлокировки,
		|				Основание.Номер КАК НомерБлокировки,
		|				ПричинаСписания КАК ПричинаСписания,
		|				ВЫБОР
		|					КОГДА СлужебнаяЗаписка.Товары.Основание ССЫЛКА Документ.ПересчетТоваров
		|						ТОГДА &НовыйРасчетОтклонения
		|					ИНАЧЕ СлужебнаяЗаписка.Товары.Отклонение
		|				КОНЕЦ КАК Отклонение
		|			) КАК Товары
		|		ИЗ
		|			Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СпрОтветственный
		|				ПО СлужебнаяЗаписка.Ответственный = СпрОтветственный.Пользователь
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СпрИсполнитель
		|				ПО СлужебнаяЗаписка.Исполнитель = СпрИсполнитель.Пользователь
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СпрРуководитель
		|				ПО СлужебнаяЗаписка.Утверждающий1 = СпрРуководитель.Пользователь
		|		ГДЕ
		|			СлужебнаяЗаписка.Ссылка В(&Ссылка)
		|		//Альтерра+ Дополнение в запрос, на отсеивание удаленных сотрудников
		|			И СпрОтветственный.ПометкаУдаления = ЛОЖЬ
		|			И СпрРуководитель.ПометкаУдаления = ЛОЖЬ
		|			И НЕ СпрОтветственный.Уволен 
		|	И СпрИсполнитель.Пользователь= СлужебнаяЗаписка.Исполнитель
		|	И СпрОтветственный.Пользователь = СлужебнаяЗаписка.Ответственный
		|	И СпрРуководитель.Пользователь = СлужебнаяЗаписка.Утверждающий1";  
		
	Запрос.Параметры.Вставить("Ссылка", Ссылка);   
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&НовыйРасчетОтклонения", 
		СтрЗаменить(Документы.ПересчетТоваров.НовыйРасчетОтклонения_ПараметрЗапроса(""), "Ссылка", "Основание"));
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Вид = Результат.Выгрузить().ВыгрузитьКолонку("Вид")[0];

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Если Вид = Пересчет Тогда
		ОбластьТекст = Макет.ПолучитьОбласть("ТекстПересчет");
	Иначе
		ОбластьТекст = Макет.ПолучитьОбласть("Текст");
	КонецЕсли;
	
	Если Вид = Пересчет Тогда
		
		ОтображатьОстатки = Истина;
		ОграничениеДоступностиОстатков = АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков();
		
		ОбластьТоварыШапка = Макет.ПолучитьОбласть("ШапкаТЧПересчетСЯПХ");
		ОбластьТовары = Макет.ПолучитьОбласть("ТЧПересчетСЯПХ");
		
	ИначеЕсли Вид = Пересорт Тогда 
		ОбластьТоварыШапка = Макет.ПолучитьОбласть("ШапкаТЧПересорт");
		ОбластьТовары = Макет.ПолучитьОбласть("ТЧПересорт");
	Иначе 
		ОбластьТоварыШапка = Макет.ПолучитьОбласть("ШапкаТЧ");
		ОбластьТовары = Макет.ПолучитьОбласть("ТЧ");
	КонецЕсли;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		//Шапка
		Если Вид = Пересчет И ОграничениеДоступностиОстатков Тогда
			УчетСкрыт = Выборка.Документ.Товары[0].Основание.УчетСкрыт;
			Если УчетСкрыт Тогда
				Если ФормироватьСОстатками = Неопределено Тогда
					Получатель = ?(Отправка, Выборка.Руководитель, Пользователи.ТекущийПользователь());
					ОтображатьОстатки = АльтерраОбщегоНазначения.ЕстьПравоПросмотраОстатков(Получатель);
				Иначе
					ОтображатьОстатки = ФормироватьСОстатками;
				КонецЕсли;
				Остатки = ?(ОтображатьОстатки,"","БезОстатков");
				ОбластьТоварыШапка = Макет.ПолучитьОбласть("ШапкаТЧПересчетСЯПХ" + Остатки);
				ОбластьТовары = Макет.ПолучитьОбласть("ТЧПересчетСЯПХ" + Остатки);
			КонецЕсли;
		КонецЕсли;
		
		ОбластьШапка.Параметры.ДолжностьИсполнитель = ПолучитьСклоненияСтроки(Выборка.ДолжностьИсполнитель,, "ПД=Дательный")[0];
		ОбластьШапка.Параметры.Исполнитель = ПолучитьСклоненияСтроки(ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.ИсполнительФИО),, "ПД=Дательный")[0];
		ОбластьШапка.Параметры.ДолжностьОтветственный = НРег(ПолучитьСклоненияСтроки(Выборка.ДолжностьОтветственный,, "ПД=Родительный")[0]);
		ОбластьШапка.Параметры.Ответственный = ПолучитьСклоненияСтроки(ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.ОтветственныйФИО),, "ПД=Родительный")[0];
		ОбластьШапка.Параметры.ДолжностьРуководитель = Выборка.ДолжностьРуководитель;
		ОбластьШапка.Параметры.Руководитель = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.РуководительФИО);
		ТабДок.Вывести(ОбластьШапка);
		
		//Заголовок
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата = Выборка.Дата;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		//Текст
		ОбластьТекст.Параметры.Вид = Нрег(Выборка.Вид);
		ОбластьТекст.Параметры.Склад = Выборка.Склад;
		Если Вид <> Пересчет Тогда
			МПричины = Выборка.Товары.Выгрузить().ВыгрузитьКолонку("ПричинаБлокировки");
			Причины = Новый Массив;
			Для каждого Элемент Из МПричины Цикл
				Если Причины.Найти(Элемент) = Неопределено Тогда
					Причины.Добавить(Элемент);
				КонецЕсли;
			КонецЦикла;
			СтрПричины = СтрСоединить(Причины, ",");
			ОбластьТекст.Параметры.Причины = СтрПричины;
		КонецЕсли;
		ОбластьТекст.Параметры.ЗаСчет = Выборка.ЗаСчет;
		ТабДок.Вывести(ОбластьТекст);
		
		//ТЧ
		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;
		
		//Подвал
		Подвал.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Подвал.Параметры.Ответственный = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.ОтветственныйФИО);
		ТабДок.Вывести(Подвал);

	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
